### Terraform plan `success`

<details><summary>Show plan</summary>

```terraform
aws_budgets_budget.spend_budget: Refreshing state... [id=747683189254:SpendBudget]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_budgets_budget.spend_budget will be destroyed
  # (because aws_budgets_budget.spend_budget is not in configuration)
  - resource "aws_budgets_budget" "spend_budget" {
      - account_id        = "747683189254" -> null
      - arn               = "arn:aws:budgets::747683189254:budget/SpendBudget" -> null
      - budget_type       = "COST" -> null
      - id                = "747683189254:SpendBudget" -> null
      - limit_amount      = "0.1" -> null
      - limit_unit        = "USD" -> null
      - name              = "SpendBudget" -> null
      - tags              = {} -> null
      - tags_all          = {} -> null
      - time_period_end   = "2087-06-15_00:00" -> null
      - time_period_start = "2025-11-01_00:00" -> null
      - time_unit         = "MONTHLY" -> null
        # (1 unchanged attribute hidden)

      - cost_types {
          - include_credit             = true -> null
          - include_discount           = true -> null
          - include_other_subscription = true -> null
          - include_recurring          = true -> null
          - include_refund             = true -> null
          - include_subscription       = true -> null
          - include_support            = true -> null
          - include_tax                = true -> null
          - include_upfront            = true -> null
          - use_amortized              = false -> null
          - use_blended                = false -> null
        }

      - notification {
          - comparison_operator        = "GREATER_THAN" -> null
          - notification_type          = "ACTUAL" -> null
          - subscriber_email_addresses = [
              - "test@test.com",
            ] -> null
          - subscriber_sns_topic_arns  = [] -> null
          - threshold                  = 0 -> null
          - threshold_type             = "ABSOLUTE_VALUE" -> null
        }
    }

  # module.bot.aws_budgets_budget.spend_budget will be created
  + resource "aws_budgets_budget" "spend_budget" {
      + account_id        = (known after apply)
      + arn               = (known after apply)
      + budget_type       = "COST"
      + id                = (known after apply)
      + limit_amount      = "1"
      + limit_unit        = "USD"
      + name              = "SpendBudget"
      + name_prefix       = (known after apply)
      + tags_all          = (known after apply)
      + time_period_end   = "2087-06-15_00:00"
      + time_period_start = (known after apply)
      + time_unit         = "MONTHLY"

      + cost_filter (known after apply)

      + cost_types (known after apply)

      + notification {
          + comparison_operator        = "GREATER_THAN"
          + notification_type          = "ACTUAL"
          + subscriber_email_addresses = [
              + "test@test.com",
            ]
          + subscriber_sns_topic_arns  = []
          + threshold                  = 0
          + threshold_type             = "ABSOLUTE_VALUE"
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @hagelstam, Action: `pull_request`*